cmsis-svd/cmsis-svd/data/Atmel/ATSAME70J20B.svd
            <register>
               <name>IMR</name>
               <description>AFEC Interrupt Mask Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EOC0</name>
                     <description>End of Conversion Interrupt Mask 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC1</name>
                     <description>End of Conversion Interrupt Mask 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC2</name>
                     <description>End of Conversion Interrupt Mask 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC3</name>
                     <description>End of Conversion Interrupt Mask 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC4</name>
                     <description>End of Conversion Interrupt Mask 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC5</name>
                     <description>End of Conversion Interrupt Mask 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC6</name>
                     <description>End of Conversion Interrupt Mask 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC7</name>
                     <description>End of Conversion Interrupt Mask 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC8</name>
                     <description>End of Conversion Interrupt Mask 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC9</name>
                     <description>End of Conversion Interrupt Mask 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC10</name>
                     <description>End of Conversion Interrupt Mask 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC11</name>
                     <description>End of Conversion Interrupt Mask 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRDY</name>
                     <description>Data Ready Interrupt Mask</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GOVRE</name>
                     <description>General Overrun Error Interrupt Mask</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMPE</name>
                     <description>Comparison Event Interrupt Mask</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEMPCHG</name>
                     <description>Temperature Change Interrupt Mask</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <description>AFEC Interrupt Status Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EOC0</name>
                     <description>End of Conversion 0 (cleared by reading AFEC_CDRx)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC1</name>
                     <description>End of Conversion 1 (cleared by reading AFEC_CDRx)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC2</name>
                     <description>End of Conversion 2 (cleared by reading AFEC_CDRx)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC3</name>
                     <description>End of Conversion 3 (cleared by reading AFEC_CDRx)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC4</name>
                     <description>End of Conversion 4 (cleared by reading AFEC_CDRx)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC5</name>
                     <description>End of Conversion 5 (cleared by reading AFEC_CDRx)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC6</name>
                     <description>End of Conversion 6 (cleared by reading AFEC_CDRx)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC7</name>
                     <description>End of Conversion 7 (cleared by reading AFEC_CDRx)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC8</name>
                     <description>End of Conversion 8 (cleared by reading AFEC_CDRx)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC9</name>
                     <description>End of Conversion 9 (cleared by reading AFEC_CDRx)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC10</name>
                     <description>End of Conversion 10 (cleared by reading AFEC_CDRx)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC11</name>
                     <description>End of Conversion 11 (cleared by reading AFEC_CDRx)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRDY</name>
                     <description>Data Ready (cleared by reading AFEC_LCDR)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GOVRE</name>
                     <description>General Overrun Error (cleared by reading AFEC_ISR)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMPE</name>
                     <description>Comparison Error (cleared by reading AFEC_ISR)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEMPCHG</name>
                     <description>Temperature Change (cleared on read)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVER</name>
               <description>AFEC Overrun Status Register</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>OVRE0</name>
                     <description>Overrun Error 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE1</name>
                     <description>Overrun Error 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE2</name>
                     <description>Overrun Error 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE3</name>
                     <description>Overrun Error 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE4</name>
                     <description>Overrun Error 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE5</name>
                     <description>Overrun Error 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE6</name>
                     <description>Overrun Error 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE7</name>
                     <description>Overrun Error 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE8</name>
                     <description>Overrun Error 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE9</name>
                     <description>Overrun Error 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE10</name>
                     <description>Overrun Error 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE11</name>
                     <description>Overrun Error 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CWR</name>
               <description>AFEC Compare Window Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LOWTHRES</name>
                     <description>Low Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>HIGHTHRES</name>
                     <description>High Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CGR</name>
               <description>AFEC Channel Gain Register</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GAIN0</name>
                     <description>Gain for Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GAIN1</name>
                     <description>Gain for Channel 1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GAIN2</name>
                     <description>Gain for Channel 2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GAIN3</name>
                     <description>Gain for Channel 3</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GAIN4</name>
                     <description>Gain for Channel 4</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GAIN5</name>
                     <description>Gain for Channel 5</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GAIN6</name>
                     <description>Gain for Channel 6</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GAIN7</name>
                     <description>Gain for Channel 7</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GAIN8</name>
                     <description>Gain for Channel 8</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GAIN9</name>
                     <description>Gain for Channel 9</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GAIN10</name>
                     <description>Gain for Channel 10</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GAIN11</name>
                     <description>Gain for Channel 11</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIFFR</name>
               <description>AFEC Channel Differential Register</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DIFF0</name>
                     <description>Differential inputs for channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF1</name>
                     <description>Differential inputs for channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF2</name>
                     <description>Differential inputs for channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF3</name>
                     <description>Differential inputs for channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF4</name>
                     <description>Differential inputs for channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF5</name>
                     <description>Differential inputs for channel 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF6</name>
                     <description>Differential inputs for channel 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF7</name>
                     <description>Differential inputs for channel 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF8</name>
                     <description>Differential inputs for channel 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF9</name>
                     <description>Differential inputs for channel 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF10</name>
                     <description>Differential inputs for channel 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIFF11</name>
                     <description>Differential inputs for channel 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSELR</name>
               <description>AFEC Channel Selection Register</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CSEL</name>
                     <description>Channel Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CDR</name>
               <description>AFEC Channel Data Register</description>
               <addressOffset>0x68</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Converted Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COCR</name>
               <description>AFEC Channel Offset Compensation Register</description>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>AOFF</name>
                     <description>Analog Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
