cmsis-svd/cmsis-svd/data/Atmel/ATSAME70J20B.svd
            <register>
               <name>RXF1S</name>
               <description>Receive FIFO 1 Status Register</description>
               <addressOffset>0xB4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>F1FL</name>
                     <description>Receive FIFO 1 Fill Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>F1GI</name>
                     <description>Receive FIFO 1 Get Index</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>F1PI</name>
                     <description>Receive FIFO 1 Put Index</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>F1F</name>
                     <description>Receive FIFO 1 Fill Level</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1L</name>
                     <description>Receive FIFO 1 Message Lost</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMS</name>
                     <description>Debug Message Status</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DMSSelect</name>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>Idle state, wait for reception of debug messages, DMA request is cleared.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MSG_A</name>
                           <description>Debug message A received.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MSG_AB</name>
                           <description>Debug messages A, B received.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MSG_ABC</name>
                           <description>Debug messages A, B, C received, DMA request is set.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF1A</name>
               <description>Receive FIFO 1 Acknowledge Register</description>
               <addressOffset>0xB8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>F1AI</name>
                     <description>Receive FIFO 1 Acknowledge Index</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXESC</name>
               <description>Receive Buffer / FIFO Element Size Configuration Register</description>
               <addressOffset>0xBC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>F0DS</name>
                     <description>Receive FIFO 0 Data Field Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>F0DSSelect</name>
                        <enumeratedValue>
                           <name>_8_BYTE</name>
                           <description>8-byte data field</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_12_BYTE</name>
                           <description>12-byte data field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BYTE</name>
                           <description>16-byte data field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_20_BYTE</name>
                           <description>20-byte data field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24_BYTE</name>
                           <description>24-byte data field</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BYTE</name>
                           <description>32-byte data field</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_48_BYTE</name>
                           <description>48-byte data field</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64_BYTE</name>
                           <description>64-byte data field</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>F1DS</name>
                     <description>Receive FIFO 1 Data Field Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>F1DSSelect</name>
                        <enumeratedValue>
                           <name>_8_BYTE</name>
                           <description>8-byte data field</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_12_BYTE</name>
                           <description>12-byte data field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BYTE</name>
                           <description>16-byte data field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_20_BYTE</name>
                           <description>20-byte data field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24_BYTE</name>
                           <description>24-byte data field</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BYTE</name>
                           <description>32-byte data field</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_48_BYTE</name>
                           <description>48-byte data field</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64_BYTE</name>
                           <description>64-byte data field</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RBDS</name>
                     <description>Receive Buffer Data Field Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>RBDSSelect</name>
                        <enumeratedValue>
                           <name>_8_BYTE</name>
                           <description>8-byte data field</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_12_BYTE</name>
                           <description>12-byte data field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BYTE</name>
                           <description>16-byte data field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_20_BYTE</name>
                           <description>20-byte data field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24_BYTE</name>
                           <description>24-byte data field</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BYTE</name>
                           <description>32-byte data field</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_48_BYTE</name>
                           <description>48-byte data field</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64_BYTE</name>
                           <description>64-byte data field</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBC</name>
               <description>Transmit Buffer Configuration Register</description>
               <addressOffset>0xC0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TBSA</name>
                     <description>Tx Buffers Start Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>NDTB</name>
                     <description>Number of Dedicated Transmit Buffers</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFQS</name>
                     <description>Transmit FIFO/Queue Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFQM</name>
                     <description>Tx FIFO/Queue Mode</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXFQS</name>
               <description>Transmit FIFO/Queue Status Register</description>
               <addressOffset>0xC4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TFFL</name>
                     <description>Tx FIFO Free Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFGI</name>
                     <description>Tx FIFO Get Index</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TFQPI</name>
                     <description>Tx FIFO/Queue Put Index</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TFQF</name>
                     <description>Tx FIFO/Queue Full</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXESC</name>
               <description>Transmit Buffer Element Size Configuration Register</description>
               <addressOffset>0xC8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TBDS</name>
                     <description>Tx Buffer Data Field Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>TBDSSelect</name>
                        <enumeratedValue>
                           <name>_8_BYTE</name>
                           <description>8-byte data field</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_12_BYTE</name>
                           <description>12-byte data field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BYTE</name>
                           <description>16-byte data field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_20_BYTE</name>
                           <description>20-byte data field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24_BYTE</name>
                           <description>24-byte data field</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BYTE</name>
                           <description>32-byte data field</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_48_BYTE</name>
                           <description>48-byte data field</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64_BYTE</name>
                           <description>64-byte data field</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
